perf/results/elasticsearch/write_200rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 2.349ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.183ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.141ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.187ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.09ms    3.73ms  59.46ms   96.94%
    Req/Sec    54.67     97.23   800.00     78.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.48ms
 75.000%    1.96ms
 90.000%    2.49ms
 99.000%   23.18ms
 99.900%   37.85ms
 99.990%   59.49ms
 99.999%   59.49ms
100.000%   59.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.255     0.000000            1         1.00
       0.775     0.100000          404         1.11
       1.003     0.200000          797         1.25
       1.181     0.300000         1198         1.43
       1.338     0.400000         1596         1.67
       1.481     0.500000         1993         2.00
       1.555     0.550000         2194         2.22
       1.642     0.600000         2394         2.50
       1.744     0.650000         2594         2.86
       1.844     0.700000         2789         3.33
       1.955     0.750000         2988         4.00
       2.019     0.775000         3090         4.44
       2.087     0.800000         3189         5.00
       2.177     0.825000         3287         5.71
       2.255     0.850000         3388         6.67
       2.351     0.875000         3488         8.00
       2.421     0.887500         3536         8.89
       2.491     0.900000         3587        10.00
       2.589     0.912500         3636        11.43
       2.701     0.925000         3686        13.33
       2.869     0.937500         3735        16.00
       2.993     0.943750         3760        17.78
       3.179     0.950000         3785        20.00
       3.515     0.956250         3810        22.86
       4.065     0.962500         3835        26.67
       5.659     0.968750         3860        32.00
       7.355     0.971875         3872        35.56
       9.663     0.975000         3885        40.00
      10.919     0.978125         3897        45.71
      13.831     0.981250         3910        53.33
      17.583     0.984375         3922        64.00
      18.751     0.985938         3928        71.11
      19.967     0.987500         3935        80.00
      21.791     0.989062         3941        91.43
      24.175     0.990625         3947       106.67
      25.711     0.992188         3953       128.00
      28.063     0.992969         3956       142.22
      28.879     0.993750         3960       160.00
      29.423     0.994531         3963       182.86
      29.935     0.995313         3966       213.33
      30.127     0.996094         3969       256.00
      30.399     0.996484         3970       284.44
      32.799     0.996875         3973       320.00
      32.831     0.997266         3974       365.71
      33.279     0.997656         3975       426.67
      34.719     0.998047         3977       512.00
      34.719     0.998242         3977       568.89
      35.007     0.998437         3978       640.00
      35.679     0.998633         3979       731.43
      37.855     0.998828         3980       853.33
      57.567     0.999023         3981      1024.00
      57.567     0.999121         3981      1137.78
      57.567     0.999219         3981      1280.00
      58.527     0.999316         3982      1462.86
      58.527     0.999414         3982      1706.67
      58.783     0.999512         3983      2048.00
      58.783     0.999561         3983      2275.56
      58.783     0.999609         3983      2560.00
      58.783     0.999658         3983      2925.71
      58.783     0.999707         3983      3413.33
      59.487     0.999756         3984      4096.00
      59.487     1.000000         3984          inf
#[Mean    =        2.093, StdDeviation   =        3.729]
#[Max     =       59.456, Total count    =         3984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6004 requests in 30.01s, 615.64KB read
Requests/sec:    200.07
Transfer/sec:     20.51KB