perf/results/elasticsearch/write_500rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 3.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.448ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.937ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.53ms   35.10ms 788.48ms   98.55%
    Req/Sec   133.36    209.70     1.33k    96.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.76ms
 75.000%    2.33ms
 90.000%    3.38ms
 99.000%   60.61ms
 99.900%  613.89ms
 99.990%  766.46ms
 99.999%  788.99ms
100.000%  788.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.343     0.000000            1         1.00
       0.971     0.100000          998         1.11
       1.221     0.200000         1997         1.25
       1.417     0.300000         3001         1.43
       1.593     0.400000         3993         1.67
       1.765     0.500000         4994         2.00
       1.850     0.550000         5491         2.22
       1.945     0.600000         5988         2.50
       2.055     0.650000         6487         2.86
       2.185     0.700000         6991         3.33
       2.333     0.750000         7486         4.00
       2.421     0.775000         7735         4.44
       2.513     0.800000         7983         5.00
       2.645     0.825000         8236         5.71
       2.791     0.850000         8480         6.67
       3.017     0.875000         8731         8.00
       3.173     0.887500         8854         8.89
       3.381     0.900000         8979        10.00
       3.739     0.912500         9104        11.43
       4.199     0.925000         9228        13.33
       5.259     0.937500         9353        16.00
       6.011     0.943750         9415        17.78
       7.743     0.950000         9478        20.00
       9.367     0.956250         9540        22.86
      14.591     0.962500         9602        26.67
      20.479     0.968750         9665        32.00
      24.047     0.971875         9696        35.56
      25.823     0.975000         9727        40.00
      29.807     0.978125         9758        45.71
      34.655     0.981250         9789        53.33
      38.015     0.984375         9821        64.00
      42.431     0.985938         9836        71.11
      46.527     0.987500         9852        80.00
      53.695     0.989062         9867        91.43
      63.263     0.990625         9883       106.67
      83.455     0.992188         9899       128.00
     117.055     0.992969         9906       142.22
     143.999     0.993750         9914       160.00
     177.279     0.994531         9922       182.86
     228.863     0.995313         9930       213.33
     309.503     0.996094         9938       256.00
     337.663     0.996484         9941       284.44
     380.671     0.996875         9945       320.00
     415.487     0.997266         9949       365.71
     454.399     0.997656         9953       426.67
     473.343     0.998047         9957       512.00
     495.871     0.998242         9959       568.89
     516.607     0.998437         9961       640.00
     524.799     0.998633         9963       731.43
     587.775     0.998828         9965       853.33
     638.975     0.999023         9967      1024.00
     643.583     0.999121         9968      1137.78
     670.207     0.999219         9969      1280.00
     694.783     0.999316         9970      1462.86
     715.263     0.999414         9971      1706.67
     737.279     0.999512         9972      2048.00
     737.279     0.999561         9972      2275.56
     741.887     0.999609         9973      2560.00
     741.887     0.999658         9973      2925.71
     763.903     0.999707         9974      3413.33
     763.903     0.999756         9974      4096.00
     763.903     0.999780         9974      4551.11
     766.463     0.999805         9975      5120.00
     766.463     0.999829         9975      5851.43
     766.463     0.999854         9975      6826.67
     766.463     0.999878         9975      8192.00
     766.463     0.999890         9975      9102.22
     788.991     0.999902         9976     10240.00
     788.991     1.000000         9976          inf
#[Mean    =        5.533, StdDeviation   =       35.098]
#[Max     =      788.480, Total count    =         9976]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14898 requests in 30.06s, 1.49MB read
Requests/sec:    495.54
Transfer/sec:     50.81KB